In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
grades = pd.Series([2,7,5,10,6])
grades

0     2
1     7
2     5
3    10
4     6
dtype: int64

In [4]:
grades.values

array([ 2,  7,  5, 10,  6])

In [5]:
grades.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
grades = pd.Series([2,7,5,10,6], index=["Luca", "Giovanni", "Maria", "Giuseppe", "Antonio"])
grades

Luca         2
Giovanni     7
Maria        5
Giuseppe    10
Antonio      6
dtype: int64

In [13]:
print("Average:", grades.mean())
print("Standard deviation: {:.2f}".format(grades.std()))

Average: 6.0
Standard deviation: 2.92

In [15]:
grades.describe().apply("{:.2f}".format)

count     5.00
mean      6.00
std       2.92
min       2.00
25%       5.00
50%       6.00
75%       7.00
max      10.00
dtype: object

In [16]:
grades**2

Luca          4
Giovanni     49
Maria        25
Giuseppe    100
Antonio      36
dtype: int64

In [17]:
np.log(grades)

Luca        0.693147
Giovanni    1.945910
Maria       1.609438
Giuseppe    2.302585
Antonio     1.791759
dtype: float64

In [19]:
df = pd.DataFrame({'Student' : ["Luca", "Giovanni", "Maria", "Giuseppe", "Antonio"], 
                   'Absences' : [3,4,2,1,4],
                   'Test' : [2,7,5,10,6],
                   'Seminar': [8.5,7.5,9.0,7.5,8.0]})
df

    Student  Absences  Test  Seminar
0      Luca         3     2      8.5
1  Giovanni         4     7      7.5
2     Maria         2     5      9.0
3  Giuseppe         1    10      7.5
4   Antonio         4     6      8.0

In [21]:
df.dtypes

Student      object
Absences      int64
Test          int64
Seminar     float64
dtype: object

In [22]:
df.columns

Index(['Student', 'Absences', 'Test', 'Seminar'], dtype='object')

In [24]:
df["Test"]

0     2
1     7
2     5
3    10
4     6
Name: Test, dtype: int64

In [28]:
df.describe().applymap("{:.2f}".format)

      Absences   Test Seminar
count     5.00   5.00    5.00
mean      2.80   6.00    8.10
std       1.30   2.92    0.65
min       1.00   2.00    7.50
25%       2.00   5.00    7.50
50%       3.00   6.00    8.00
75%       4.00   7.00    8.50
max       4.00  10.00    9.00

In [29]:
df.sort_values(by="Test")

    Student  Absences  Test  Seminar
0      Luca         3     2      8.5
2     Maria         2     5      9.0
4   Antonio         4     6      8.0
1  Giovanni         4     7      7.5
3  Giuseppe         1    10      7.5

In [30]:
df

    Student  Absences  Test  Seminar
0      Luca         3     2      8.5
1  Giovanni         4     7      7.5
2     Maria         2     5      9.0
3  Giuseppe         1    10      7.5
4   Antonio         4     6      8.0

In [32]:
df.loc[3]

Student     Giuseppe
Absences           1
Test              10
Seminar          7.5
Name: 3, dtype: object

In [34]:
df[df["Seminar"] > 8.0]

  Student  Absences  Test  Seminar
0    Luca         3     2      8.5
2   Maria         2     5      9.0

In [35]:
df[(df["Seminar"] > 8.0) & (df["Test"] > 3)]

  Student  Absences  Test  Seminar
2   Maria         2     5      9.0